# Taps
tap 'hashicorp/tap'
tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/cask'
tap 'warrensbox/tap'
tap 'knqyf263/pet'
tap 'wader/tap'
tap 'koekeishiya/formulae'

# Binaries
brew 'awscli'
brew 'azure-cli'
brew 'bash'                 # Latest Bash version
brew 'broot'                # Like tree but better
brew 'coreutils'            # Those that come with macOS are outdated
brew 'fd'
brew 'findutils'
brew 'gh'
brew 'git'
brew 'gnu-sed'
brew 'go'
brew 'graphviz'
brew 'grpcurl'
brew 'grpcui'
brew 'hstr'
brew 'hugo'
brew 'jq'
brew 'kubectl'
brew 'libpq'                # psql
brew 'mackup'
brew 'mas'                  # Mac App Store manager
brew 'moreutils'
brew 'nmap'
brew 'node'
brew 'openssh'
brew 'pet'
brew 'protobuf'
brew 'pstree'
brew 'skhd'
brew 'ssh-copy-id'
brew 'the_silver_searcher'
brew 'vim'
brew 'tfswitch'
brew 'tree'
brew 'tmux'
brew 'watch'
brew 'yabai'
brew 'yarn'
brew 'yq'
brew 'z'


# Apps
cask 'alacritty'
cask 'flameshot'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'github'
cask 'maccy'                # Clipboard manager
cask 'macdown'
cask 'multipass'
cask 'nordpass'
cask 'orbstack'
cask 'postman'
cask 'proxyman'
cask 'sentinel'
cask 'sloth'
cask 'visual-studio-code'
cask 'wireshark'


# Fonts 

# Mac App Store
