# Taps
tap 'hashicorp/tap'
tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/cask'
tap 'warrensbox/tap'
tap 'knqyf263/pet'
tap 'wader/tap'

# Binaries
brew 'awscli'
brew 'azure-cli'
brew 'bash'                 # Latest Bash version
brew 'broot'                # Like tree but better
brew 'coreutils'            # Those that come with macOS are outdated
brew 'docker'
brew 'fd'
brew 'findutils'
brew 'fq'
brew 'gh'
brew 'git'
brew 'gnu-sed'
brew 'graphviz'
brew 'hstr'
brew 'jq'
brew 'kubectl'
brew 'libpq'                # psql
brew 'mackup'
brew 'mas'                  # Mac App Store manager
brew 'moreutils'
brew 'nmap'
brew 'node'
brew 'openssh'
brew 'pet'
brew 'pstree'
brew 'ssh-copy-id'
brew 'the_silver_searcher'
brew 'vim'
brew 'tfswitch'
brew 'yarn'
brew 'z'


# Apps
cask '1password'
cask '1password-cli'
cask 'alacritty'
cask 'docker'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'google-drive-file-stream'
cask 'github'
cask 'iterm2'
cask 'maccy'                # Clipboard manager
cask 'postman'
cask 'proxyman'
cask 'rectangle'
cask 'sentinel'
cask 'slack'
cask 'visual-studio-code'
cask 'wireshark'
cask 'zoom'


# Fonts 

# Mac App Store
